In [1]:
import pandas as pd

In [12]:
# Series (column of a dataframe, akin to a py dictionary)

values = [10,20,30,40,50]
s = pd.Series(values, index= ['a','b','c','d','e'])

s.loc['a'] # can look up an object by index

# DataFrame (concatenation of series) - will build a table with an automatic index

df = pd.DataFrame({
    'name' : ['Gam', 'Atarah', 'Shem'],
    'age': [37, 37, 7],
    'job':['Student', 'Teacher','Child']
})

df = df.set_index('name') #changes the index so that we can search with .loc[]

In [13]:
df.loc['Gam']

age         37
job    Student
Name: Gam, dtype: object

In [15]:
# by providing an index, we are able to do arithmatic operations of dataframes
df1 = pd.DataFrame({
    'a':[1,2,3]
},index=[0,1,2])

df2 = pd.DataFrame({
    'a':[10,20,30]
},index=[1,2,0])

df1 + df2

    a
0  31
1  12
2  23

In [17]:
# Can export the datafreame to other formats
# first reset the index so that the index is numerical instead of by name

df = df.reset_index()

In [28]:
# by hitting the tab button after typing, the menu populates
# export to csv
df.to_csv('mydata.csv',index=None)

In [29]:
pd.read_csv('mydata.csv')

     name  age      job
0     Gam   37  Student
1  Atarah   37  Teacher
2    Shem    7    Child

In [26]:
# when we read in the dataframe initially, we have an unnamed col (if the DF is not index=None). I can set the index_col to 0 
pd.read_csv('mydata.csv',index_col=0)

     name  age      job
0     Gam   37  Student
1  Atarah   37  Teacher
2    Shem    7    Child

In [2]:
from sklearn.datasets import fetch_california_housing

In [4]:
data = fetch_california_housing(as_frame=True).frame
data.head()

,MedInc,HouseAge,AveRooms,AveBedrms,Population,AveOccup,Latitude,Longitude,MedHouseVal
0,8.3252,41.0,6.984127,1.023810,322.0,2.555556,37.88,-122.23,4.526
1,8.3014,21.0,6.238137,0.971880,2401.0,2.109842,37.86,-122.22,3.585
2,7.2574,52.0,8.288136,1.073446,496.0,2.802260,37.85,-122.24,3.521
3,5.6431,52.0,5.817352,1.073059,558.0,2.547945,37.85,-122.25,3.413
4,3.8462,52.0,6.281853,1.081081,565.0,2.181467,37.85,-122.25,3.422

In [6]:
import sklearn
print(sklearn.__version__)

1.6.1